<template>
  <div id="app">
    <router-view/>
    <div id="player"></div>
  </div>
</template>

<script>
  import 'aplayer/dist/APlayer.min.css';
  import APlayer from 'aplayer';
export default {
  name: 'app',
  components: {
  },
  mounted:function () {
    const ap = new APlayer({
      container: document.getElementById('player'),
      fixed: true,
      showlrc: true,
      autoplay:false,
      audio: [{ "name": "My Heart Will Go On", "artist": "Celine Dion", "url": "http://music.163.com/song/media/outer/url?id=2308499.mp3", "cover": "http://p1.music.126.net/mO1OUNjZtCEIvAGdr7YXaA==/813638604607979.jpg?param=130y130", "lrc": "[00:00.000] 作曲 : James Horner\n" +
                "[00:01.000] 作词 : Will Jennings\n" +
                "[00:19.729]Every night in my dreams\n" +
                "[00:24.290]I see you\n" +
                "[00:26.709]I feel you\n" +
                "[00:29.419]That is how I know you go on\n" +
                "[00:41.379]Far across the distance\n" +
                "[00:43.156]And spaces between us.\n" +
                "[00:48.766]You have come to show you go on\n" +
                "[00:58.495]Near far,\n" +
                "[01:02.726]wherever you are\n" +
                "[01:07.289]I believe that the heart does go on\n" +
                "[01:18.170]Once more,\n" +
                "[01:22.188]you open the door,\n" +
                "[01:27.789] And you're here in my heart.\n" +
                "[01:32.060]And my heart will go on and on\n" +
                "[01:41.700]Love can touch us one time.\n" +
                "[01:49.722]And last for a lifetime\n" +
                "[01:57.587]And never let go till we're gone,\n" +
                "[02:06.906]Love was when I loved you\n" +
                "[02:11.390]One true time I hold to.\n" +
                "[02:16.789]In my life we'll always go on.\n" +
                "[02:26.990]Near far,\n" +
                "[02:30.990]wherever you are\n" +
                "[02:34.729]I believe that the heart does go on\n" +
                "[02:45.527]Once more,\n" +
                "[02:49.759]you open the door,\n" +
                "[02:54.270]And you've been in my heart,\n" +
                "[02:59.299]And my heart will go on and on\n" +
                "[03:09.700][03:25.390]You're here,\n" +
                "[03:30.090]there's nothing I fear.\n" +
                "[03:32.979]And I know that my heart will go on\n" +
                "[03:44.990]we'll stay forever this way.\n" +
                "[03:52.990]You are safe in my heart,\n" +
                "[03:57.589]and my heart will go on and on" },

        { "name": "竈門炭治郎のうた", "artist": "中川奈美", "url": "http://music.163.com/song/media/outer/url?id=1397097038.mp3", "cover": "http://p2.music.126.net/hq9g3-7lBQoUIYA7kHGWmQ==/109951164428837079.jpg?param=130y130", "lrc":"[by:晴空之海]\n" +
                  "[00:00.000] 作曲 : 椎名豪\n" +
                  "[00:01.000] 作词 : ufotable\n" +
                  "[00:18.671]目を閉じて 思い出す\n" +
                  "[00:25.672]過ぎ去りし あの頃の\n" +
                  "[00:31.920]戻れない 帰れない\n" +
                  "[00:37.922]広がった 深い闇\n" +
                  "[01:37.423]戻れない 帰れない\n" +
                  "[01:44.424]広がった 深い闇\n" +
                  "[01:51.925]泣きたくなるような 優しい音\n" +
                  "[02:04.428]どんなに苦しくても\n" +
                  "[02:09.674]前へ 前へ 進め 絶望断ち\n" +
                  "[02:22.423]失っても 失っても\n" +
                  "[02:28.169]生きていくしかない\n" +
                  "[02:35.926]どんなにうちのめされても\n" +
                  "[02:42.171]守るものがある\n" +
                  "[03:15.922]失っても 失っても\n" +
                  "[03:21.679]生きていくしかない\n" +
                  "[03:29.679]どんなにうちのめされても\n" +
                  "[03:35.926]守るものがある\n" +
                  "[03:53.921]我に課す 一択の\n" +
                  "[04:00.678]運命と 覚悟する\n" +
                  "[04:06.425]泥を舐め 足掻いても\n" +
                  "[04:12.670]目に見えぬ 細い糸\n" +
                  "[04:19.675]泣きたくなるような 優しい音\n" +
                  "[04:32.920]どんなに悔しくても\n" +
                  "[04:37.924]前へ 前へ 向かえ 絶望断ち\n" +
                  "[04:50.670]傷ついても 傷ついても\n" +
                  "[04:56.418]立ち上がるしかない\n" +
                  "[05:04.429]どんなにうちのめされても\n" +
                  "[05:10.919]守るものがある\n" +
                  "[05:17.175]守るものがある" },

        { "name": "Lemon", "artist": "米津玄師", "url": "http://music.163.com/song/media/outer/url?id=536622304.mp3", "cover": "http://p2.music.126.net/6IeZ9MiSSDXifj74nzH6ww==/109951163561494000.jpg?param=130y130", "lrc": "[00:00.000] 作曲 : 米津玄師\n" +
                  "[00:00.283] 作词 : 米津玄師\n" +
                  "[00:00.850]夢ならばどれほどよかったでしょう\n" +
                  "[00:06.650]未だにあなたのことを夢にみる\n" +
                  "[00:12.340]忘れた物を取りに帰るように\n" +
                  "[00:17.660]古びた思い出の埃を払う\n" +
                  "[00:25.820]戻らない幸せがあることを\n" +
                  "[00:31.580]最後にあなたが教えてくれた\n" +
                  "[00:36.980]言えずに隠してた昏い過去も\n" +
                  "[00:42.550]あなたがいなきゃ永遠に昏いまま\n" +
                  "[00:48.230]きっともうこれ以上 傷つくことなど\n" +
                  "[00:53.750]ありはしないとわかっている\n" +
                  "[00:58.660]あの日の悲しみさえ\n" +
                  "[01:01.410]あの日の苦しみさえ\n" +
                  "[01:04.150]そのすべてを愛してた あなたとともに\n" +
                  "[01:09.800]胸に残り離れない\n" +
                  "[01:12.730]苦いレモンの匂い\n" +
                  "[01:15.730]雨が降り止むまでは帰れない\n" +
                  "[01:21.240]今でもあなたはわたしの光\n" +
                  "[01:37.600]暗闇であなたの背をなぞった\n" +
                  "[01:42.980]その輪郭を鮮明に覚えている\n" +
                  "[01:48.800]受け止めきれないものと出会うたび\n" +
                  "[01:54.400]溢れてやまないのは涙だけ\n" +
                  "[01:59.990]何をしていたの\n" +
                  "[02:02.760]何を見ていたの\n" +
                  "[02:05.580]わたしの知らない横顔で\n" +
                  "[02:10.390]どこかであなたが今\n" +
                  "[02:13.380]わたしと同じ様な\n" +
                  "[02:15.950]涙にくれ 淋しさの中にいるなら\n" +
                  "[02:21.470]わたしのことなどどうか 忘れてください\n" +
                  "[02:27.490]そんなことを心から願うほどに\n" +
                  "[02:32.910]今でもあなたはわたしの光\n" +
                  "[02:41.600]自分が思うより 恋をしていたあなたに\n" +
                  "[02:52.410]あれから思うように 息ができない\n" +
                  "[03:03.360]あんなに側にいたのにまるで嘘みたい\n" +
                  "[03:14.140]とても忘れられないそれだけが確か\n" +
                  "[03:30.430]あの日の悲しみさえ\n" +
                  "[03:33.200]あの日の苦しみさえ\n" +
                  "[03:35.910]その全てを愛してたあなたと共に\n" +
                  "[03:41.320]胸に残り離れない\n" +
                  "[03:44.280]苦いレモンの匂い\n" +
                  "[03:47.730]雨が降り止むまでは帰れない\n" +
                  "[03:52.840]切り分けた果実の片方の様に\n" +
                  "[03:58.590]今でもあなたはわたしの光" },

        { "name": "前前前世", "artist": "RADWIMPS", "url": "https://cn-south-17-aplayer-46154810.oss.dogecdn.com/yourname.mp3", "cover": "https://cn-south-17-aplayer-46154810.oss.dogecdn.com/yourname.jpg", "lrc": "[00:00.000] 作曲 : 野田洋次郎\n" + "[00:01.000] 作词 : 野田洋次郎\n" + "[00:19.600]\n" + "[00:20.000]やっと眼を覚ましたかい それなのになぜ眼も合わせやしないんだい？\n" + "[00:30.090]「遅いよ」と怒る君 これでもやれるだけ飛ばしてきたんだよ\n" + "[00:38.720]\n" + "[00:39.670]心が身体を追い越してきたんだよ\n" + "[00:44.340]\n" + "[00:45.340]君の髪や瞳だけで胸が痛いよ\n" + "[00:50.560]同じ時を吸いこんで離したくないよ\n" + "[00:55.200]遥か昔から知る その声に\n" + "[01:00.260]生まれてはじめて 何を言えばいい？\n" + "[01:07.240]\n" + "[01:07.640]君の前前前世から僕は 君を探しはじめたよ\n" + "[01:12.280]そのぶきっちょな笑い方をめがけて やってきたんだよ\n" + "[01:17.260]\n" + "[01:17.630]君が全然全部なくなって チリヂリになったって\n" + "[01:22.430]もう迷わない また１から探しはじめるさ\n" + "[01:27.240]むしろ０から また宇宙をはじめてみようか\n" + "[01:32.670]\n" + "[01:43.440]どっから話すかな 君が眠っていた間のストーリー\n" + "[01:53.480]何億 何光年分の物語を語りにきたんだよ けどいざその姿この眼に映すと\n" + "[02:07.720]\n" + "[02:08.720]君も知らぬ君とジャレて 戯れたいよ\n" + "[02:13.530]君の消えぬ痛みまで愛してみたいよ\n" + "[02:18.480]銀河何個分かの 果てに出逢えた\n" + "[02:23.530]その手を壊さずに どう握ったならいい？\n" + "[02:30.500]\n" + "[02:31.000]君の前前前世から僕は 君を探しはじめたよ\n" + "[02:35.680]その騒がしい声と涙をめがけ やってきたんだよ\n" + "[02:40.550]\n" + "[02:40.990]そんな革命前夜の僕らを誰が止めるというんだろう\n" + "[02:45.720]もう迷わない 君のハートに旗を立てるよ\n" + "[02:50.740]君は僕から諦め方を 奪い取ったの\n" + "[02:55.880]\n" + "[03:53.030]前前前世から僕は 君を探しはじめたよ\n" + "[03:57.290]そのぶきっちょな笑い方をめがけて やってきたんだよ\n" + "[04:01.990]\n" + "[04:02.620]君が全然全部なくなって チリヂリになったって\n" + "[04:07.240]もう迷わない また１から探しはじめるさ\n" + "[04:12.370]何光年でも この歌を口ずさみながら\n" + "[04:18.090]" },
        { "name": "Alone + Sing Me To Sleep", "artist": "J·Fla", "url": "http://music.163.com/song/media/outer/url?id=564405370.mp3", "cover": "http://p4.music.126.net/79vdQ-WExvH5f_h3GvXcXQ==/109951163694979815.jpg?param=200y200", "lrc": "[00:00.000] 作曲 : Iselin Solheim\n[00:01.000] 作词 : Noonie Bao\n[00:10.7]Wait a second, let me catch my breath\n[00:15.83]Remind me how it feels to hear your voice\n[00:21.29]Your lips are movin’, I can’t hear a thing\n[00:27.7]Livin’ life as if we had a choice\n[00:32.71]Anywhere, any time\n[00:35.45]I would do anything for you\n[00:40.51]Anything for you\n[00:43.67]Yesterday got away\n[00:46.51]Melody stuck inside your head\n[00:51.70]A song in every breath\n[00:54.38]Sing me to sleep now\n[00:59.66]Sing me to sleep\n[01:04.64]Won’t you sing me to sleep now？\n[01:10.47]Sing me to sleep\n[01:40.48]Lost in your mind\n[01:48.21]I wanna know\n[01:50.97]Am I losing my mind\n[01:59.0]Never let me go\n[02:01.61]If this night is not forever\n[02:05.14]At least we are together\n[02:07.93]I know I’m not alone\n[02:10.46]I know I’m not alone\n[02:13.83]Anywhere, whenever\n[02:15.98]Apart but still together\n[02:18.34]I know I’m not alone\n[02:21.41]I know I’m not alone\n" },
        { "name": "心做し", "artist": "鹿乃", "url": "http://music.163.com/song/media/outer/url?id=40915694.mp3", "cover": "http://p2.music.126.net/w5-FU13Owl_VbKfybBwx3A==/2884019003563753.jpg?param=130y130", "lrc": "[by:-南大鸟-]\n" + "[00:00.68]ねえ もしも全て投げ捨てられたら\n" + "[00:06.52]笑って生きることが楽になるの\n" + "[00:12.28]また胸が痛くなるから\n" + "[00:16.63]もう 何も言わないでよ\n" + "[00:23.35]...\n" + "[00:46.44]ねえ もしも全ては忘れられたなら\n" + "[00:52.17]泣かないで生きることも楽になるの\n" + "[00:57.87]でも そんなこと出来ないから\n" + "[01:02.25]もう 何も見せないでよ\n" + "[01:07.91]君にどれだけ近ずいても\n" + "[01:13.63]僕の心臓は一つだけ\n" + "[01:19.44]酷いよ 酷いよ もういっそ僕の体を\n" +
                  "[01:25.05]壊して 引き裂いて 好きなようにしてよ\n" +
                  "[01:30.78]叫んで もがいて 瞼をはらしても\n" +
                  "[01:36.47]まだ君は僕のことを抱きしめて離さない\n" +
                  "[01:42.25]もういいよ\n" +
                  "[01:55.04]ねえ もしも僕の願いが叶うなら\n" +
                  "[02:00.77]君と同じものが欲しんだ\n" +
                  "[02:06.50]でも僕には存在しないから\n" +
                  "[02:10.79]じゃあ せめてここに来てよ\n" +
                  "[02:17.64]...\n" +
                  "[02:42.20]君にどれだけ愛されても\n" +
                  "[02:47.91]僕の心臓は一つだけ\n" +
                  "[02:53.61]やめてよ やめてよ 優しくしないでよ\n" +
                  "[02:59.37]どうしても僕には理解が出来ないよ\n" +
                  "[03:05.08]痛いよ 痛いよ 言葉で教えてよ\n" +
                  "[03:10.80]こんなの知らないよ 一人にしないで\n" +
                  "[03:16.60]酷いよ 酷いよ もういっそ僕の体を\n" +
                  "[03:22.17]壊して 引き裂いて 好きなようにしてよ\n" +
                  "[03:27.90]叫んで もがいて 瞼をはらしても\n" +
                  "[03:33.60]まだ君は僕のことを抱きしめて離さない\n" +
                  "[03:39.37]もういいよ\n" +
                  "[03:40.51]...\n" +
                  "[04:03.61]ねえ もしも僕に心があるなら\n" +
                  "[04:09.34]どうやってそれを見つければいいの\n" +
                  "[04:15.05]少し微笑んで君が言う\n" +
                  "[04:19.42]そらはね ここにあるよ" }]
    });
  }
}
</script>

<style>

</style>
